// пошёл по более простому методу, так как с присваиванием элементам массива значений вызвали затруднения, я упростил всё )))
int Left = 5;
int Right = 5;

if (Left > Right) // при ">" if игнорировалось и переходило к else; устраняем это через if/else if/ else 
{
    Console.WriteLine($"Нечетных Больше = {Left}");
}
else if (Right > Left)
{
    Console.WriteLine($"Четных Больше = {Right}");
}
else Left = Right;
{
    Console.WriteLine($"Жителей по ровну по обе стороны");
}
// немного помучился, больше затрудней было только в написании нежели в понимании. Пользовалься так же подсказкой в виде metanit на сколько это возможно))